alibaba/AliOS-Things/platform/mcu/stm32l4xx/src/STM32L496G-Discovery/deviceIO/soc_init.c
	  hal_uart_init(&uart_dev_com1);
}

static void gpio_init(void)
{
    __HAL_RCC_GPIOB_CLK_ENABLE();

	  gpio_dev_GPIOB_PIN13.port = HAL_GPIO_29;
	  gpio_dev_GPIOB_PIN13.config = OUTPUT_PUSH_PULL;

    hal_gpio_init(&gpio_dev_GPIOB_PIN13);
}

static void timer3_init(void)
{
  dev_timer3.config.reload_mode = TIMER_RELOAD_AUTO;
  dev_timer3.config.period = 1000000;
  dev_timer3.config.cb = &timer3_isr;
  dev_timer3.port = PORT_TIMER3;

  hal_timer_init(&dev_timer3);
}

uint32_t timer3_count = 0;
void timer3_isr(void *arg)
{
	 timer3_count++;
}

static void rtc_init(void)
{
    rtc_time_t time_cur;

    memset(&time_cur,0,sizeof(time_cur));

    dev_rtc.config.format = HAL_RTC_FORMAT_BCD;

    hal_rtc_init(&dev_rtc);

    time_cur.year = 0x18;
    time_cur.month = 0x03;
    time_cur.date = 0x14;
    time_cur.weekday = 0x03;
    time_cur.hr = 0x12;
    time_cur.min = 0x30;
    time_cur.sec = 0x45;

    hal_rtc_set_time(&dev_rtc, &time_cur);
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
     PE0   ------> FMC_NBL0
     PB4 (NJTRST)   ------> SPI1_MISO
     PA15 (JTDI)   ------> SPI1_NSS
     PH14   ------> DCMI_D4
     PI7   ------> DCMI_D7
     PE1   ------> FMC_NBL1
     PB5   ------> SPI1_MOSI
     PG9   ------> FMC_NE2
     PD0   ------> FMC_D2_DA2
     PI6   ------> S_TIM8_CH2
     PI2   ------> SPI2_MISO
     PI1   ------> SPI2_SCK
     PH15   ------> TIM8_CH3N
     PH12   ------> DCMI_D3
     PB8   ------> I2C1_SCL
     PB6   ------> USART1_TX
     PD4   ------> FMC_NOE
     PD1   ------> FMC_D3_DA3
     PH13   ------> TIM8_CH1N
     PE4   ------> SAI1_FS_A
     PE3   ------> SAI1_SD_B
     PE2   ------> SAI1_MCLK_A
     PB9   ------> S_TIM4_CH4
     PB7   ------> I2C1_SDA
     PG10   ------> USART1_RX
     PD5   ------> FMC_NWE
     PD2   ------> SDMMC1_CMD
     PC10   ------> SDMMC1_D2
     PI4   ------> DCMI_D5
     PH9   ------> DCMI_D0
     PA12   ------> USB_OTG_FS_DP
     PE6   ------> SAI1_SD_A
     PE5   ------> DCMI_D6
     PG11   ------> USART1_CTS
     PC11   ------> SDMMC1_D3
     PI5   ------> DCMI_VSYNC
     PA11   ------> USB_OTG_FS_DM
     PF2   ------> FMC_A2
     PF1   ------> FMC_A1
     PF0   ------> FMC_A0
     PG12   ------> USART1_RTS
     PD7   ------> FMC_NE1
     PC12   ------> SDMMC1_CK
     PA10   ------> USB_OTG_FS_ID
     PF3   ------> FMC_A3
     PF4   ------> FMC_A4
     PF5   ------> FMC_A5
     PA8   ------> LPTIM2_OUT
     PC9   ------> SDMMC1_D1
     PC8   ------> SDMMC1_D0
     PC7   ------> S_DATAIN3DFSDM1
     PF10   ------> ADC3_IN13
     PC4   ------> ADCx_IN13
     PG1   ------> FMC_A11
     PE10   ------> FMC_D7_DA7
     PB11   ------> QUADSPI_BK1_NCS
     PG8   ------> LPUART1_RX
     PG7   ------> LPUART1_TX
     PD15   ------> FMC_D1_DA1
     PC0   ------> ADCx_IN1
     PC1   ------> ADCx_IN2
     PC2   ------> S_CKOUTDFSDM1
     PG0   ------> FMC_A10
     PE9   ------> FMC_D6_DA6
     PE15   ------> FMC_D12_DA12
     PG5   ------> FMC_A15
     PG4   ------> FMC_A14
     PG3   ------> FMC_A13
     PG2   ------> FMC_A12
     PD10   ------> FMC_D15_DA15
     PC3   ------> ADCx_IN4
     PA5   ------> SPI1_SCK
     PB0   ------> QUADSPI_BK1_IO1
     PF15   ------> FMC_A9
     PE8   ------> FMC_D5_DA5
     PE14   ------> FMC_D11_DA11
     PH4   ------> I2C2_SCL
     PD14   ------> FMC_D0_DA0
     PD12   ------> FMC_A17_ALE
     PD11   ------> FMC_A16_CLE
     PD13   ------> FMC_A18
     PA4   ------> ADCx_IN9
     PA7   ------> QUADSPI_BK1_IO2
     PB1   ------> QUADSPI_BK1_IO0
     PF14   ------> FMC_A8
     PE7   ------> FMC_D4_DA4
     PE13   ------> FMC_D10_DA10
     PH5   ------> DCMI_PIXCLK
     PD9   ------> FMC_D14_DA14
     PD8   ------> FMC_D13_DA13
     PA3   ------> QUADSPI_CLK
     PA6   ------> QUADSPI_BK1_IO3
     PF13   ------> FMC_A7
     PE12   ------> FMC_D9_DA9
     PH10   ------> DCMI_D1
     PH11   ------> DCMI_D2
     PB15   ------> SPI2_MOSI
     PB14   ------> I2C2_SDA
     PA1   ------> ADCx_IN6
     PF12   ------> FMC_A6
     PE11   ------> FMC_D8_DA8
     PB10   ------> SAI1_SCK_A
     PH8   ------> DCMI_HSYNC
     PB12   ------> S_DATAIN1DFSDM1
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOI_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  HAL_PWREx_EnableVddIO2();
  __HAL_RCC_GPIOD_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOF_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LCD_BL_GPIO_Port, LCD_BL_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOH, MFX_WAKEUP_Pin|LCD_PWR_ON_Pin|MIC_VDD_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(Audio_RST_GPIO_Port, Audio_RST_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pins : JOY_DOWN_Pin JOY_LEFT_Pin JOY_UP_Pin */
  GPIO_InitStruct.Pin = JOY_DOWN_Pin|JOY_LEFT_Pin|JOY_UP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);

  /*Configure GPIO pin : STMOD_INT_Pin */
  GPIO_InitStruct.Pin = STMOD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(STMOD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : PSRAM_NBL0_Pin PSRAM_NBL1_Pin D7_Pin D6_Pin 
                           D12_Pin D5_Pin D11_Pin D4_Pin 
                           D10_Pin D9_Pin D8_Pin */
  GPIO_InitStruct.Pin = PSRAM_NBL0_Pin|PSRAM_NBL1_Pin|D7_Pin|D6_Pin 
                          |D12_Pin|D5_Pin|D11_Pin|D4_Pin 
                          |D10_Pin|D9_Pin|D8_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF12_FMC;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

